const indeOf = (arr,val) => {
    for(let i in arr){
        if(arr[i]===val) return i;
    }
    return -1;
}


indeOf([7,2,3,4,5],5); // -> 4
indeOf([1,7,3,4,5],5); // -> 4
indeOf([1,2,7,4,5],5); // -> 4
indeOf([1,2,3,7,5],5); // -> 4
indeOf([1,2,3,4,7],5); // -> 4
indeOf([1,2,3,4,5],5); // -> 4
indeOf([1,2,3,4,5],5); // -> 4

ああああああああああああ
ああああああああああああ
ああああああああああああ
ああああああああああああ
ああああああああああああ
ああああああああああああ
ああああああああああああ
ああああああああああああ
ああああああああああああ



indeOf([1,2,3,4,5],5); // -> 4
indeOf([1,2,3,4,5],5); // -> 4
indeOf([1,2,3,4,5],5); // -> 4
indeOf([1,2,3,4,5],5); // -> 4
indeOf([1,2,3,4,5],5); // -> 4
indeOf([1,2,3,4,5],5); // -> 4